#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.iam.aws_iam_role.worker: Refreshing state... [id=ed-eks-worker]
module.iam.aws_iam_policy.ebs_csi_policy: Refreshing state... [id=arn:aws:iam::522814736852:policy/EBS_CSI_Policy]
module.vpc.aws_vpc.eks_vpc: Refreshing state... [id=vpc-02f56ee9e3d3071cb]
module.iam.aws_iam_policy.autoscaler: Refreshing state... [id=arn:aws:iam::522814736852:policy/ed-eks-autoscaler-policy]
module.iam.aws_iam_role.master: Refreshing state... [id=EKS-Master]
module.iam.aws_iam_role_policy_attachment.AmazonEKSServicePolicy: Refreshing state... [id=EKS-Master-2025020103472989210000000a]
module.iam.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=EKS-Master-20250201034729884300000009]
module.iam.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=EKS-Master-2025020103472992580000000b]
module.iam.aws_iam_role_policy_attachment.autoscaler: Refreshing state... [id=ed-eks-worker-20250201034729607500000002]
module.iam.aws_iam_instance_profile.worker: Refreshing state... [id=EKS-worker-nodes-profile]
module.iam.aws_iam_role_policy_attachment.ebs_csi_policy_attachment: Refreshing state... [id=ed-eks-worker-20250201034729600500000001]
module.iam.aws_iam_role_policy_attachment.s3: Refreshing state... [id=ed-eks-worker-20250201034729708600000005]
module.iam.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=ed-eks-worker-20250201034729727700000006]
module.iam.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=ed-eks-worker-20250201034729829300000008]
module.iam.aws_iam_role_policy_attachment.AmazonSSMManagedInstanceCore: Refreshing state... [id=ed-eks-worker-20250201034729661000000003]
module.iam.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=ed-eks-worker-20250201034729782100000007]
module.iam.aws_iam_role_policy_attachment.x-ray: Refreshing state... [id=ed-eks-worker-20250201034729693700000004]
module.vpc.aws_internet_gateway.eks_internet_gateway: Refreshing state... [id=igw-092244712681472d1]
module.security_groups.aws_security_group.eks_nodes_sg: Refreshing state... [id=sg-0b5ed4aad1a226c16]
module.vpc.aws_subnet.public_subnet_az2: Refreshing state... [id=subnet-01a251745520cc7c7]
module.security_groups.aws_security_group.eks_cluster_sg: Refreshing state... [id=sg-0fa270b83f29493f0]
module.vpc.aws_subnet.public_subnet_az1: Refreshing state... [id=subnet-0f4c4b2f5d73e493d]
module.vpc.aws_route_table.public_route_table: Refreshing state... [id=rtb-0b59cb077e3fe67ce]
module.security_groups.aws_security_group_rule.worker_node_to_worker_node_ingress_coredns_udp: Refreshing state... [id=sgrule-3906742893]
module.security_groups.aws_security_group_rule.eks_cluster_ingress_nodes: Refreshing state... [id=sgrule-1170608224]
module.security_groups.aws_security_group_rule.eks_cluster_egress_kublet: Refreshing state... [id=sgrule-3994077523]
module.security_groups.aws_security_group_rule.worker_node_to_worker_node_ingress_coredns_tcp: Refreshing state... [id=sgrule-1283688834]
module.security_groups.aws_security_group_rule.worker_node_ingress_nginx: Refreshing state... [id=sgrule-841845881]
module.security_groups.aws_security_group_rule.worker_node_ingress_ssh: Refreshing state... [id=sgrule-3334964199]
module.security_groups.aws_security_group_rule.eks_cluster_egress_nginx: Refreshing state... [id=sgrule-1372368052]
module.security_groups.aws_security_group_rule.worker_node_ingress_kublet: Refreshing state... [id=sgrule-1258224709]
module.security_groups.aws_security_group_rule.worker_node_egress_internet: Refreshing state... [id=sgrule-2357756829]
module.security_groups.aws_security_group_rule.ingress_allow_access_from_control_plane: Refreshing state... [id=sgrule-1452064690]
module.security_groups.aws_security_group_rule.worker_node_to_worker_node_ingress_ephemeral: Refreshing state... [id=sgrule-1344349047]
module.vpc.aws_route_table_association.public_subnet_az2_route_table_association: Refreshing state... [id=rtbassoc-0031e04e080db4401]
module.vpc.aws_route_table_association.public_subnet_az1_route_table_association: Refreshing state... [id=rtbassoc-0a1f0929ab6ab708c]
module.eks.aws_eks_cluster.eks: Refreshing state... [id=eks-cluster]
module.eks.aws_eks_addon.example["vpc-cni"]: Refreshing state... [id=eks-cluster:vpc-cni]
module.eks.aws_eks_addon.example["kube-proxy"]: Refreshing state... [id=eks-cluster:kube-proxy]
module.eks.aws_eks_addon.example["aws-ebs-csi-driver"]: Refreshing state... [id=eks-cluster:aws-ebs-csi-driver]
module.eks.aws_launch_template.eks_launch_template: Refreshing state... [id=lt-0e1ccbe9d480e3cd1]
module.eks.aws_eks_node_group.eks_nodes: Refreshing state... [id=eks-cluster:my-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.eks.aws_eks_addon.example["aws-ebs-csi-driver"] will be updated in-place
  ~ resource "aws_eks_addon" "example" {
      ~ addon_version               = "v1.37.0-eksbuild.1" -> "v1.38.1-eksbuild.2"
        id                          = "eks-cluster:aws-ebs-csi-driver"
        tags                        = {}
        # (9 unchanged attributes hidden)
    }

  # module.eks.aws_eks_addon.example["coredns"] will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.4-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.example["kube-proxy"] will be updated in-place
  ~ resource "aws_eks_addon" "example" {
      ~ addon_version               = "v1.31.3-eksbuild.2" -> "v1.32.0-eksbuild.2"
        id                          = "eks-cluster:kube-proxy"
        tags                        = {}
        # (9 unchanged attributes hidden)
    }

  # module.eks.aws_eks_node_group.eks_nodes will be updated in-place
  ~ resource "aws_eks_node_group" "eks_nodes" {
        id                     = "eks-cluster:my-node-group"
        tags                   = {
            "Name" = "EKS-NodeGroup-eks-cluster"
        }
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0e1ccbe9d480e3cd1"
            name    = "eks-launch-template-20250201035438542400000011"
          ~ version = "1" -> "$Latest"
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ravisrma, Action: `pull_request`*